# IsValidDefaultTemplate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewFamilyType..::..IsValidDefaultTemplate Method
ViewFamilyType Class See Also
---
Verifies that the input can be used as a default template for this view type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidDefaultTemplate(
	ElementId templateId
)
```

Visual Basic
---
```text
Public Function IsValidDefaultTemplate ( _
	templateId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidDefaultTemplate(
	ElementId^ templateId
)
```

# ### Parameters
templateId
    Type: Autodesk.Revit.DB..::..ElementId Id to be validated as default template.
# ### Return Value
True if %templateId% is valid as default template, false otherwise.
# Remarks
The id must represent a template view that is compatible with this view type, or InvalidElementId.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace